# 1Depth 카테고리들 매핑용 대분류 dict
CATEGORY_MAPPING = {
    '소설/시/희곡': [
        '소설/시/희곡',
        '고전',
        '장르소설',
        '에세이',
    ],
    
    '경제경영': [
        '경제경영',
        '법률',
    ],
    
    '자기계발': [
        '자기계발',
        '좋은부모',
    ],
    
    '인문/교양': [
        '인문학',
        '인문/사회',
        '사회과학',
        '역사',
        '종교/역학',
        '종교/명상/점술',
        '예술/대중문화',
        '전기/자서전',
        '언어학',
    ],
    
    '취미/실용': [
        '가정/요리/뷰티',
        '가정/원예/인테리어',
        '가족/관계',
        '건강/취미/레저',
        '건강/스포츠',
        '게임/토이',
        '공예/취미/수집',
        '요리',
        '여행',
        '건축/디자인',
        '잡지',
        '해외 잡지',
        '달력/기타',
        '달력/다이어리/연감',
        'Gift',
        '문구/비도서',
        '유머',
        '오디오북',
        '금강산 여행 가는 이에게',
        '만화',
    ],
    
    '어린이/청소년': [
        '어린이',
        '유아',
        '청소년',
        '청소년_ 추천도서',
    ],
    
    '학습지': [
        '초등학교참고서',
        '중학교참고서',
        '고등학교참고서',
        '대학교재/전문서적',
        '대학교재',
        '수험서/자격증',
        '수험서',
        '외국어',
        'ELT/어학/사전',
        '교육/자료',
        '의학',
        '전집/중고전집',
        '일본 도서',
        '중국 도서',
        '대만도서',
        '독일 도서',
        '스페인 도서',
        '기타 언어권 도서',
        '한국관련도서',
    ],
    
    '과학': [
        '과학',
        '자연과학',
        '기술공학',
        '컴퓨터/모바일',
        '컴퓨터',
        '기타',
    ],
}